Reports/20230728_145534/CountryCapital/20230728_145534/requests/main/0.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2023-07-28T07:55:47.750Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://www.oorsprong.org/websamples.countryinfo\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <web:CountryISOCode>\n         <web:sCountryName>United States</web:sCountryName>\n      </web:CountryISOCode>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "private, max-age=0"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Vary",
          "value" : "Accept-Encoding"
        }, {
          "name" : "Web-Service",
          "value" : "DataFlex 19.1"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Fri, 28 Jul 2023 07:55:42 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "content" : {
          "size" : 341,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryISOCodeResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryISOCodeResult>US</m:CountryISOCodeResult>\r\n    </m:CountryISOCodeResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 165,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "wait" : 0,
        "blocked" : -1,
        "dns" : -1,
        "connect" : 0,
        "send" : 0,
        "receive" : 0,
        "ssl" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "0",
        "testObjectId" : "Object Repository/API Latihan/SOAP/SOAP Service (1)/CountryInfoServiceSoapBinding/CountryISOCode",
        "harId" : "88ddbf46-b2e1-47fc-a034-ea9f9f494494",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}